Revit 2027 API
TriangulatedShellComponent.GetVertex Method
 Returns the vertex with a given index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetVertex(
	int vertexIndex
)
Public Function GetVertex (
	vertexIndex As Integer
) As XYZ
public:
XYZ^ GetVertex(
	int vertexIndex
)
member GetVertex :
        vertexIndex : int -> XYZ
Parameters
vertexIndex Int32
 The index of the vertex (between 0 and getVertexCount()-1, inclusive).
Return Value
XYZ
 A copy of the requested vertex.
Exceptions
Exception | Condition
ArgumentException |  vertexIndex is out of range.
See Also
Reference
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace